# # приймає рядок з логу як вхідний параметр 
# # повертає словник з розібраними компонентами: дата, час, рівень, повідомлення. 
# # Використовуйте методи рядків, такі як split(), для розділення рядка на частини.
def parse_log_line(line: str) -> dict:  # Отримує лог у вигляді строки
    date, time, level, *args = line.split(' ')  # Отримує дату, час, рівень зі строки
    message = ' '.join(args).removesuffix('\n') # Форматує текст повідомлення
    line_dict = {'date': date, 'time': time, 'level': level, 'message': message} # Створює словник логу
    return line_dict # Повертає словник логу